#!/usr/bin/env python
# coding: utf-8

# ## 동적계획법 (DP)
# 
# #### 네트워크 선 자르기 (Bottom-Up)
# 앞에 구해놓은 해를 이용해 최종적인 해를 구하는 방법
# 
# #### Q. 네트워크 선을 1m, 2m의 길이를 갖는 선으로 자르려고 합니다.
# #### 예를 들어 4m의 네트워크 선이 주어진다면
# 
# 1+1+1+1
# 2+1+1+
# 1+2+1
# 1+1+2
# 2+2
# 
# #### 의 다섯가지 방법을 생각할 수 있습니다.
# 
# #### 네트워크 선의 길이가 n이라면 몇 가지의 자르는 방법을 생각할 수 있을까요?
# 
# n=7
# 
# dy 1차원 배열을 만들고 첫번째 자리에 전부 1로 잘랐을때 가지수를 넣는다.
# dy[0] = 1
# 
# 2로 잘랐을때
# dy[1] = 2
# 
# 3일 경우를 생각하면  1로 잘랐을때 가지수와 2로 잘랐을때 가지수를 더하면된다.
# dy=[2] = 3
# 
# 4일 경우 앞의 두 수를 더하면된다.
# dy[3] = 5
# 
# 결국 규칙을 식으로 나타내면 
# 
# #### f(n) = f(n-2) + f(n-1) 이 된다.
# 
# 이를 코드로 구현해보면
# 

# In[1]:


n=7

dy=[0]*(n+1)
dy[1]=1
dy[2]=2

for i in range(3, n+1):
    dy[i] = dy[i-1]+ dy[i-2]
    
print(dy[n])


# In[ ]:




